GlomarGadaffi/ESP32_AdBlocker_Reborn/main/dns_sink.cpp
    esp_vfs_fat_sdmmc_mount_config_t mcfg = {};
    mcfg.format_if_mount_failed = false;
    mcfg.max_files              = 4;
    mcfg.allocation_unit_size   = 16 * 1024;

    /* SD-over-SPI init is occasionally flaky (ESP_ERR_INVALID_RESPONSE on the
     * probe). Retry a few times before giving up and falling back to download. */
    for (int attempt = 1; attempt <= 4; attempt++) {
        rc = esp_vfs_fat_sdspi_mount(SD_MOUNT, &host, &slot, &mcfg, &s_sd_card);
        if (rc == ESP_OK) {
            ESP_LOGI(TAG, "SD mounted (attempt %d): %lluMB", attempt,
                     (uint64_t)s_sd_card->csd.capacity * s_sd_card->csd.sector_size / (1024*1024));
            return;
        }
        ESP_LOGW(TAG, "SD mount attempt %d/4 failed: %s", attempt, esp_err_to_name(rc));
        vTaskDelay(pdMS_TO_TICKS(250));
    }
    ESP_LOGW(TAG, "SD mount failed after retries — no SD cache");
    spi_bus_free(SD_SPI_HOST);
}

/* ── Blocklist download task (Core 0, priority 2) ────────────────── */
static void download_task(void *)
{
    /* Boot: try SD cache first for instant blocking. If present, DO NOT
     * re-download on every boot — it wastes ~230s of bandwidth and opens a
     * sort null-window. The daily-reload timer (or manual /reload) refreshes. */
    bool from_sd = blocklist_load_sd();
    if (!from_sd) {
        ESP_LOGI(TAG, "No SD cache — downloading blocklist...");
        blocklist_load();
    } else {
        ESP_LOGI(TAG, "SD cache active (%" PRIu32 " domains) — skipping boot refresh",
                 blocklist_domain_count());
    }
    ESP_LOGI(TAG, "download_task stack hwm: %u bytes free",
             (unsigned)uxTaskGetStackHighWaterMark(NULL));

    /* Reload every 4h on a fixed cadence. Scheduling itself stays on the
     * monotonic esp_timer (immune to NTP re-sync jumps — see L3, where an
     * absolute-wall-clock "sleep then reload" loop drifted); NTP wall-clock
     * (timesync_epoch()) is used only to log a real timestamp, once synced.
     * Use an absolute deadline advanced by exactly one interval each cycle
     * (next += interval) so the download/sort duration never pushes the
     * schedule later. A manual /reload fires immediately without shifting it. */
    const int64_t interval_us = 4LL * 60 * 60 * 1000000;  /* 4h */
    int64_t next_us = esp_timer_get_time() + interval_us;
    for (;;) {
        int64_t now_us = esp_timer_get_time();
        if (now_us >= next_us) {
            if (timesync_is_synced()) {
                time_t epoch = (time_t)timesync_epoch();
                char ts[32]; struct tm tmv; gmtime_r(&epoch, &tmv);
                strftime(ts, sizeof(ts), "%Y-%m-%d %H:%M:%S UTC", &tmv);
                ESP_LOGI(TAG, "4h reload (%s)...", ts);
            } else {
                ESP_LOGI(TAG, "4h reload (clock not yet synced)...");
            }
            blocklist_load();
            next_us += interval_us;
            if (next_us <= esp_timer_get_time())     /* fell behind — catch up */
                next_us = esp_timer_get_time() + interval_us;
            continue;
        }
        if (s_reload_requested) {
            s_reload_requested = false;
            ESP_LOGI(TAG, "Manual reload...");
            blocklist_load();   /* does not shift the daily deadline */
            continue;
        }
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* ── L2 fast-path RX hook ────────────────────────────────────────────
 * Overrides the eth driver's stack-input. Blocked DNS A/AAAA queries are
 * answered here (craft frame + esp_eth_transmit) WITHOUT touching lwIP —
 * removing the ~1.5ms socket/stack overhead from the sinkhole hot path.
 * Everything else passes through to lwIP unchanged (DHCP, httpd, forwarding,
 * cache, allowed queries). Runs single-threaded in the eth RX task. */
static uint32_t s_l2_blocked = 0;   /* L2-handled blocked queries (bypassed lwIP) */
static uint32_t s_l2_cached  = 0;   /* L2-handled forward-cache hits (bypassed lwIP) */
extern "C" uint32_t dns_sink_l2_blocked(void) { return s_l2_blocked; }
extern "C" uint32_t dns_sink_l2_cached(void)  { return s_l2_cached; }

/* Parse question qname → normalized name; return qend offset within DNS msg. */
static int l2_qname(const uint8_t *dns, int dns_len, char *out, size_t cap, size_t *outlen)
{
    static char raw[256];
    int off = 12; size_t rl = 0;
    while (off < dns_len && dns[off] != 0) {
        uint8_t l = dns[off];
        if ((l & 0xC0) == 0xC0) return -1;              /* no compression in question */
        if (l & 0xC0) return -1;                        /* #42: reserved label type */
        if (off + 1 + l > dns_len || rl + l + 1 >= sizeof(raw)) return -1;
        if (rl) raw[rl++] = '.';
        memcpy(raw + rl, dns + off + 1, l); rl += l; off += 1 + l;
    }
    if (off >= dns_len) return -1;
    off++;                                               /* null label */
    if (off + 4 > dns_len) return -1;                    /* qtype + qclass */
    size_t nl = domain_normalize(out, cap, raw, rl);
    if (!nl) return -1;
    *outlen = nl;
    return off + 4;
}

static esp_err_t l2_input_cb(esp_eth_handle_t h, uint8_t *buf, uint32_t len,
                             void *priv, void *info)
{
    (void)info;
    static uint8_t  tx[600];
    static char     name[256];
    do {
        if (len < 14 + 20 + 8 + 13) break;               /* min IPv4/UDP/DNS */
        if (buf[12] != 0x08 || buf[13] != 0x00) break;   /* IPv4 only */
        int ihl = (buf[14] & 0x0F) * 4;
        if (ihl < 20 || buf[14 + 9] != 17) break;        /* UDP only */
        int udp = 14 + ihl;
        if (udp + 8 > (int)len) break;
        if (((buf[udp + 2] << 8) | buf[udp + 3]) != 53) break;   /* dst port 53 */
        int dns = udp + 8, dns_len = (int)len - dns;
        if (dns_len < 12) break;
        if (buf[dns + 2] & 0x80) break;                  /* must be a query (QR=0) */
        if (((buf[dns + 4] << 8) | buf[dns + 5]) != 1) break;    /* qdcount==1 */
        size_t nlen = 0;
        int qend = l2_qname(buf + dns, dns_len, name, sizeof(name), &nlen);
        if (qend < 0) break;
        uint16_t qtype = (buf[dns + qend - 4] << 8) | buf[dns + qend - 3];
        if (qtype != 1 && qtype != 28) break;            /* A / AAAA only */
        if (!blocklist_is_blocked_nb(name, nlen)) {      /* not blocked → try L2 cache, else lwIP */
            /* Forward-cache hit answered straight from L2, skipping lwIP — the
             * same socket-stack overhead the blocked path already bypasses. Lay
             * the eth+ip+udp headers into tx, then the seqlock-protected reader
             * copies the cached DNS reply right after them. Miss/race → lwIP. */
            int clen = dns_cache_l2_get(domain_hash(name, nlen), qtype,
                                        tx + dns, (int)sizeof(tx) - dns);
            if (clen <= 0) break;                        /* miss/expired/race → lwIP */
            memcpy(tx, buf, dns);                         /* eth+ip+udp headers */
            uint8_t s6[6]; memcpy(s6,tx,6); memcpy(tx,tx+6,6); memcpy(tx+6,s6,6);            /* swap MAC */
            uint8_t s4[4]; memcpy(s4,tx+14+12,4); memcpy(tx+14+12,tx+14+16,4); memcpy(tx+14+16,s4,4); /* swap IP */
            uint8_t s2[2]; memcpy(s2,tx+udp,2); memcpy(tx+udp,tx+udp+2,2); memcpy(tx+udp+2,s2,2);     /* swap ports */
            tx[dns] = buf[dns]; tx[dns+1] = buf[dns+1];   /* patch txid to this query */
            int iptot_c = ihl + 8 + clen;
            tx[14+2]=(iptot_c>>8); tx[14+3]=(iptot_c&0xFF);
            int udplen_c = 8 + clen;
            tx[udp+4]=(udplen_c>>8); tx[udp+5]=(udplen_c&0xFF);
            tx[udp+6]=0; tx[udp+7]=0;                     /* zero UDP checksum (legal IPv4) */
            tx[14+10]=0; tx[14+11]=0;                     /* IP checksum */
            uint32_t csum=0;
            for (int i=0;i<ihl;i+=2) csum += (tx[14+i]<<8)|tx[14+i+1];
            while (csum>>16) csum=(csum&0xFFFF)+(csum>>16);
            uint16_t cks=~csum; tx[14+10]=(cks>>8); tx[14+11]=(cks&0xFF);
            esp_eth_transmit(h, tx, dns + clen);
            s_l2_cached++;
            free(buf);                                    /* consumed (== eth_l2_free) */
            return ESP_OK;
        }

        /* ── craft blocked response in tx ── */
        int rdlen = (qtype == 28) ? 16 : 4;
        int dns_resp = qend + 12 + rdlen;                /* question + answer RR */
        int frame = dns + dns_resp;
        if (frame > (int)sizeof(tx)) break;
        memcpy(tx, buf, dns + qend);                     /* eth+ip+udp+dns(hdr+question) */
        uint8_t t6[6];
        memcpy(t6, tx, 6); memcpy(tx, tx + 6, 6); memcpy(tx + 6, t6, 6);          /* swap MAC */
        uint8_t t4[4];
        memcpy(t4, tx+14+12, 4); memcpy(tx+14+12, tx+14+16, 4); memcpy(tx+14+16, t4, 4); /* swap IP */
        uint8_t t2[2];
        memcpy(t2, tx+udp, 2); memcpy(tx+udp, tx+udp+2, 2); memcpy(tx+udp+2, t2, 2);     /* swap ports */
        { uint16_t qf = (buf[dns+2] << 8) | buf[dns+3];
          uint16_t rf = dns_resp_flags(qf, 0);
          tx[dns+2] = (rf >> 8); tx[dns+3] = (rf & 0xFF); }
        tx[dns+6] = 0; tx[dns+7] = 1;                    /* ancount=1 */
        tx[dns+8] = 0; tx[dns+9] = 0; tx[dns+10] = 0; tx[dns+11] = 0;  /* ns/ar=0 */
        uint8_t *a = tx + dns + qend;
        a[0]=0xC0; a[1]=0x0C; a[2]=(qtype>>8); a[3]=(qtype&0xFF);
        a[4]=0; a[5]=1; a[6]=0; a[7]=0; a[8]=0; a[9]=10;             /* class IN, ttl 10 */
        a[10]=(rdlen>>8); a[11]=(rdlen&0xFF);
        memset(a+12, 0, rdlen);                          /* 0.0.0.0 / :: */
        int iptot = ihl + 8 + dns_resp;
        tx[14+2]=(iptot>>8); tx[14+3]=(iptot&0xFF);
        int udplen = 8 + dns_resp;
        tx[udp+4]=(udplen>>8); tx[udp+5]=(udplen&0xFF);
        tx[udp+6]=0; tx[udp+7]=0;                        /* zero UDP checksum (legal IPv4) */
        tx[14+10]=0; tx[14+11]=0;                        /* IP checksum */
        uint32_t sum=0;
        for (int i=0;i<ihl;i+=2) sum += (tx[14+i]<<8)|tx[14+i+1];
        while (sum>>16) sum=(sum&0xFFFF)+(sum>>16);
        uint16_t csum=~sum;
        tx[14+10]=(csum>>8); tx[14+11]=(csum&0xFF);

        esp_eth_transmit(h, tx, frame);
        s_l2_blocked++;
        free(buf);                                       /* we consumed it (== eth_l2_free) */
        return ESP_OK;
    } while (0);

    return esp_netif_receive((esp_netif_t *)priv, buf, len, NULL);
}

/* ── app_main ────────────────────────────────────────────────────── */
extern "C" void app_main(void)
{
    /* NVS */
    esp_err_t r = nvs_flash_init();
    if (r == ESP_ERR_NVS_NO_FREE_PAGES || r == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        r = nvs_flash_init();
    }
    ESP_ERROR_CHECK(r);

    /* Event loop + netif */
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

